CREATE TABLE tAcademy(
ID INT IDENTITY (1, 1) NOT NULL,
ФИО NVARCHAR (100) NOT NULL,
Дата_Рождения nvarchar(50) NOT NULL,
Специализация NVARCHAR (20) NOT NULL,
Год_Присвоения_звания INT NOT NULL
);

INSERT tAcadem VALUES
('Бартольд Василий Владимирович', '1869-11-15', 'историк', '1913'),
('Белопольский Аристарх Аполлонович', '1854-07-13', 'астрофизик', '1903'),
('Бородин Иван Парфеньевич', '1847-01-30', 'ботаник', '1902'),
('Вальден Павел Иванович', '1863-07-26', 'химик-технолог', '1910'),
('Вернадский Владимир Иванович', '1863-03-12', 'геохимик', '1908'),
('Виноградов Павел Гаврилович', '1854-11-30', 'историк', '1914'),
('Ипатьев Владимир Николаевич', '1867-11-21', 'химик', '1916'),
('Истрин Василий Михайлович', '1865-02-22', 'филолог', '1907'),
('Карпинский Александр Петрович', '1847-01-07', 'геолог', '1889'),
('Коковцов Павел Константинович', '1861-07-01', 'историк', '1906'),
('Курнаков Николай Семёнович', '1860-12-06', 'химик', '1913'),
('Марр Николай Яковлевич', '1865-01-06', 'лингвист', '1912'),
('Насонов Николай Викторович', '1855-02-26', 'зоолог', '1906'),
('Ольденбург Сергей Фёдорович', '1863-09-26', 'историк', '1903'),
('Павлов Иван Петрович', '1849-09-26', 'физиолог', '1907'),
('Перетц Владимир Николаевич', '1870-01-31', 'филолог', '1914'),
('Соболевский Алексей Иванович', '1857-01-07', 'лингвист', '1900'),
('Стеклов Владимир Андреевич', '1864-01-09', 'математик', '1912');

/*Задание 3 - 1*/
SELECT [ID]
      ,[ФИО]
      ,[Дата_Рождения]
      ,[Специализация]
      ,[Год_Присвоения_звания]
  FROM [Academy].[dbo].[tAcademy]

/*Задание 3 - 2*/
SELECT 'Академик ' + ФИО + ', дата рождения которого ' + convert(nvarchar(4), Дата_Рождения, 23) AS О_присвоении_звания
FROM [Academy].[dbo].[tAcademy]

/*Задание 3 - 3*/
SELECT [ФИО] AS Академики,
       DATEADD(YEAR, 5, Дата_Рождения) AS Должна_называтся_через_5_лет
FROM [Academy].[dbo].[tAcademy]

/*Задание 3 - 4*/
SELECT YEAR(Дата_Рождения) AS Уникальные_года
FROM [Academy].[dbo].[tAcademy]
GROUP BY YEAR(Дата_Рождения)
ORDER BY Уникальные_года

/*Задание 3 - 5*/
SELECT [ФИО], YEAR(Дата_Рождения) AS Уникальные_года
FROM [Academy].[dbo].[tAcademy]
ORDER BY Уникальные_года DESC

/*Задание 3 - 6*/
SELECT [ФИО], [Специализация], 
	   [Год_Присвоения_Звания]
FROM [Academy].[dbo].[tAcademy]
ORDER BY Специализация DESC, 
         YEAR(Год_Присвоения_звания) DESC, 
		 ФИО ASC

/*Задание 3 - 7*/
SELECT TOP 1 [ФИО]
FROM [Academy].[dbo].[tAcademy]
ORDER BY ФИО ASC

/*Задание 3 - 8*/
SELECT TOP 1 [ФИО]
FROM [Academy].[dbo].[tAcademy]
ORDER BY [Год_Присвоения_звания] ASC

/*Задание 3 - 9*/
SELECT TOP 10 PERCENT [ФИО]
FROM [Academy].[dbo].[tAcademy]
ORDER BY ФИО ASC

/*Задание 3 - 10*/
SELECT TOP 5 WITH TIES *
FROM [Academy].[dbo].[tAcademy]
ORDER BY Год_присвоения_звания

/*Задание 3 - 11*/
SELECT *
FROM [Academy].[dbo].[tAcademy]
ORDER BY ФИО 
      OFFSET 9 ROWS

/*Задание 3 - 12*/
SELECT *
FROM [Academy].[dbo].[tAcademy]
ORDER BY ФИО
OFFSET 8 ROWS
FETCH NEXT 2 ROWS ONLY