CREATE TABLE tCountry(
	ID INT IDENTITY (1, 1) NOT NULL,
	Название NVARCHAR (100) NOT NULL, 
	Столица NVARCHAR (100) NOT NULL,
	Площадь INT NOT NULL,
	Население INT NOT NULL,
	Континент NVARCHAR (100) NOT NULL,
);

INSERT tCountry VALUES
('Австрия', 'Вена', '83858', '8741753', 'Европа'),
('Азербайджан', 'Баку', '86600', '9705600', 'Азия'),
('Албания', 'Тирана', '28748', '2866026', 'Европа'),
('Алжир', 'Алжир', '2381740', '39813722', 'Африка'),
('Ангола', 'Луанда', '1246700', '25831000', 'Африка'),
('Аргентина', 'Буэнос-Айрес', '2766890', '43847000', 'Южная Америка'),
('Афганистан', 'Кабул', '647500', '29822848', 'Азия'),
('Бангладеш', 'Дакка', '144000', '160221000', 'Азия'),
('Бахрейн', 'Манама', '701', '1397000', 'Азия'),
('Белиз', 'Бельмопан', '22966', '377968', 'Северная Америка'),
('Белоруссия', 'Минск', '207595', '9498400', 'Европа'),
('Бельгия', 'Брюссель', '30528', '11250585', 'Европа'),
('Бенин', 'Порто-Ново', '112620', '11167000', 'Африка'),
('Болгария', 'София', '110910', '7153784', 'Европа'),
('Боливия', 'Сукре', '1098580', '10985059', 'Южная Америка'),
('Ботсвана', 'Габороне', '600370', '2209208', 'Африка'),
('Бразилия', 'Бразилиа', '8511965', '206081432', 'Южная Америка'),
('Буркина-Фасо', 'Уагадугу', '274200', '19034397', 'Африка'),
('Бутан', 'Тхимпху', '47000', '784000', 'Азия'),
('Великобритания', 'Лондон', '244820', '65341183', 'Европа'),
('Венгрия', 'Будапешт', '93030', '9830485', 'Европа'),
('Венесуэла', 'Каракас', '912050', '31028637', 'Южная Америка'),
('Восточный Тимор', 'Дили', '14874', '1167242', 'Азия'),
('Вьетнам', 'Ханой', '329560', '91713300', 'Азия');

/*Задание 3 - 1*/
SELECT TOP 5 [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
ORDER BY Площадь DESC

/*Задание 3 - 2*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Население] !< 1000000
	AND [Континент] = ('АФРИКА')

/*Задание 3 - 3*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Население] > 5000000
	AND [Площадь] < 100000
	AND [Континент] != ('Европа')

/*Задание 3 - 4*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Население] > 5000000
	AND ([Континент] = ('Северная Америка') OR [Континент] = ('Южная Америка'))
	AND [Население] > 2000000
	OR [Континент] = ('Африка')
	AND [Население] > 30000000

/*Задание 3 - 5*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE ([Население] > 10 AND [Население] < 100000000) AND [Площадь] !> 500000

/*Задание 3 - 6*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Название] LIKE '[^А]%'

/*Задание 3 - 7*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Название] LIKE '__а_%и_'

/*Задание 3 - 8*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Название] LIKE '_[ауеёыоэяию]%'

/*Задание 3 - 9*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Название] LIKE '[К-П]%'

/*Задание 3 - 10*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Название] LIKE '[А-Г]%' AND [Название] LIKE '[^Б]%'

/*Задание 3 - 11*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]
WHERE [Столица] IS NOT NULL

/*Задание 3 - 12*/
SELECT [Название]
	,[Столица]
	,[Площадь]
	,[Население]
	,[Континент]
FROM [Academy].[dbo].[tCountry]	
WHERE NOT [Континент] = 'Азия'
/* WHERE [Континент] = 'Северная Америка'
	AND [Континент] = 'Южная Америка'
	AND [Континент] = 'Африка' */