CREATE TABLE tCountryLab5(
	ID INT IDENTITY (1, 1) NOT NULL,
	Название NVARCHAR (100) NOT NULL, 
	Столица NVARCHAR (100) NOT NULL,
	Площадь INT NOT NULL,
	Население INT NOT NULL,
	Континент NVARCHAR (100) NOT NULL,
);

INSERT tCountryLab5 VALUES
('Австрия', 'Вена', '83858', '8741753', 'Европа'),
('Азербайджан', 'Баку', '86600', '9705600', 'Азия'),
('Албания', 'Тирана', '28748', '2866026', 'Европа'),
('Алжир', 'Алжир', '2381740', '39813722', 'Африка'),
('Ангола', 'Луанда', '1246700', '25831000', 'Африка'),
('Аргентина', 'Буэнос-Айрес', '2766890', '43847000', 'Южная Америка'),
('Афганистан', 'Кабул', '647500', '29822848', 'Азия'),
('Бангладеш', 'Дакка', '144000', '160221000', 'Азия'),
('Бахрейн', 'Манама', '701', '1397000', 'Азия'),
('Белиз', 'Бельмопан', '22966', '377968', 'Северная Америка'),
('Белоруссия', 'Минск', '207595', '9498400', 'Европа'),
('Бельгия', 'Брюссель', '30528', '11250585', 'Европа'),
('Бенин', 'Порто-Ново', '112620', '11167000', 'Африка'),
('Болгария', 'София', '110910', '7153784', 'Европа'),
('Боливия', 'Сукре', '1098580', '10985059', 'Южная Америка'),
('Ботсвана', 'Габороне', '600370', '2209208', 'Африка'),
('Бразилия', 'Бразилиа', '8511965', '206081432', 'Южная Америка'),
('Буркина-Фасо', 'Уагадугу', '274200', '19034397', 'Африка'),
('Бутан', 'Тхимпху', '47000', '784000', 'Азия'),
('Великобритания', 'Лондон', '244820', '65341183', 'Европа'),
('Венгрия', 'Будапешт', '93030', '9830485', 'Европа'),
('Венесуэла', 'Каракас', '912050', '31028637', 'Южная Америка'),
('Восточный Тимор', 'Дили', '14874', '1167242', 'Азия'),
('Вьетнам', 'Ханой', '329560', '91713300', 'Азия');

/* Задание 5 - 1 */
SELECT MIN(Площадь) AS Минимальная_площадь
FROM [Academy].[dbo].[tCountryLab5]

/* Задание 5 - 2 */
SELECT MAX(Население) AS Масимальное_население
FROM [Academy].[dbo].[tCountryLab5]
WHERE Континент='Северная Америка' OR Континент='Южная Америка'

/* Задание 5 - 3 */
SELECT ROUND(AVG(CAST(Население AS FLOAT)), 1) AS Среднее_значение
FROM [Academy].[dbo].[tCountryLab5]

/* Задание 5 - 4 */
SELECT COUNT(*) AS Количество_стран
FROM [Academy].[dbo].[tCountryLab5]
WHERE RIGHT(Название, 2)='ан' AND NOT RIGHT(Название, 4)='стан'

/* Задание 5 - 5 */
SELECT COUNT(DISTINCT Континент) AS Количество_стран
FROM [Academy].[dbo].[tCountryLab5]
WHERE LEFT(Название, 1)='р'

/* Задание 5 - 6 */

/* Исходные данные о площадях */
SELECT MAX(Площадь) AS Максимальная_площадь,
	MIN(Площадь) AS Минимальная_площадь
FROM [Academy].[dbo].[tCountryLab5]

/* Выполнение задания по условию */
SELECT MAX(Площадь) / MIN(Площадь) AS Разница
FROM [Academy].[dbo].[tCountryLab5]

/* Задание 5 - 7 */
SELECT Континент, COUNT(Название) AS Количество_стран
FROM [Academy].[dbo].[tCountryLab5]
WHERE Население > 100000000
GROUP BY Континент
ORDER BY Количество_стран ASC

/* Задание 5 - 8 */
SELECT Название, LEN(Название) AS Название_страны
FROM [Academy].[dbo].[tCountryLab5]
GROUP BY Название
ORDER BY Название_страны ASC

/* Задание 5 - 9 */
SELECT Континент,
	SUM(Население) AS Текущее_население,
    SUM(Население) * 1.1 AS Прогнозируемое_население
FROM [Academy].[dbo].[tCountryLab5]
GROUP BY Континент;

/* Задание 5 - 10 */
SELECT Континент
FROM [Academy].[dbo].[tCountryLab5]
GROUP BY Континент
HAVING MAX(Площадь) / NULLIF(MIN(Площадь), 0) <= 10000; -- Предовращает деление на 0

/* Задание 5 - 11 */
SELECT AVG(LEN(Название)) AS Средняя_длина_названий
FROM [Academy].[dbo].[tCountryLab5]
WHERE Континент = 'Африка';

/* Задание 5 - 12 */
SELECT Континент
FROM [Academy].[dbo].[tCountryLab5]
WHERE Население > 1000000
GROUP BY Континент
HAVING AVG(CAST(Население AS FLOAT) / Площадь) > 30;
